repo = "lencx/chatgpt"
repo2 = "a7ex/homebrew-formulae"
tap repo, "https://github.com/#{repo}.git"
tap repo2, "https://github.com/#{repo2}.git"
cask_args appdir: "~/HomeBrew"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "mas"
brew "whalebrew"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "duti"
brew "fastlane"
brew "harfbuzz"
brew "gh"
brew "gnupg"
brew "llvm"
brew "markdown"
brew "openjdk@17"
brew "pandoc"
brew "pinentry-mac"
brew "shadowsocks-rust"
brew "shc"
brew "shellcheck"
brew "swiftlint"
brew "vapoursynth"
brew "youtube-dl"
brew "hub"
brew "gh"
brew "rbenv"
brew "ruby-build"
brew "gpg2"
brew "chruby"
brew "ruby-install"
brew "rustup"
brew "swift-sh"
brew "node"
brew "watchman"
brew "yarn"
brew "blueutil"
brew "xcresultparser"
brew "xclogparser"
# brew "txt2tags"
# brew "pandoc"
# brew "multimarkdown"
# brew "texi2html"

# cask_args appdir: "~/Applications", require_sha: true

cask "1password"
cask "1password-cli"
cask "buildsettingextractor"
cask "docker"
cask "fig"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "krisp"
cask "macfuse"
cask "mpv"
cask "netnewswire"
cask "notion"
cask "postman"
cask "proxyman"
cask "qbittorrent"
cask "slack"
cask "ticktick"
cask "veracrypt"
cask "visual-studio-code"
cask "warp"
cask "xcodes"
cask "zoom"
cask "cloudflare-warp"
# cask "copilot-for-xcode"
# cask "spotify"
# cask "protonvpn"
# cask "nordvpn"
# cask "pocket-casts"
# cask "gitkraken"
# cask "discord"
# cask "chatgpt", args: { "no-quarantine": true }
# cask "vlc"
# cask "raycast"
# cask "virtualbox"
# cask "telegram"
# cask "whatsapp"
# cask "macs-fan-control"
# cask "microsoft-teams"
# cask "clion"
# cask "obs"
# cask "doxygen"
# cask "discord-canary"


# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Testflight", id: 899247664
# mas "Betternet", id: 1028905953
# mas "Pocket", id: 568494494
# mas "Twitter", id: 1482454543
mas "Amphetamine", id: 937984704
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "RocketSim", id: 1504940162
mas "Shazam", id: 897118787
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835