# cask_args appdir: "/Applications/HomeBrew", require_sha: true
cask_args require_sha: true

repo = "a7ex/homebrew-formulae"
tap repo, "https://github.com/#{repo}.git"
tap "homebrew/bundle"
tap "oclint/formulae"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
# tap "homebrew/cask"

brew "mas"
brew "whalebrew"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "duti"
brew "fastlane"
brew "harfbuzz"
brew "gh"
brew "gnupg"
brew "llvm"
brew "markdown"
brew "openjdk@17"
brew "pinentry-mac"
brew "shadowsocks-rust"
brew "shc"
brew "shellcheck"
brew "swiftlint"
brew "vapoursynth"
brew "hub"
brew "rbenv"
brew "ruby-build"
brew "gpg2"
brew "chruby"
brew "ruby-install"
brew "rustup"
brew "swift-sh"
brew "node"
brew "watchman"
brew "yarn"
brew "blueutil"
brew "xcresultparser"
brew "xclogparser"
brew "kdoctor"
brew "libimobiledevice"
brew "jq"
brew "automake"
brew "bison"
brew "libyaml"
brew "openssl@3"
brew "gdbm"
brew "readline"
brew "libffi"
brew "wget"
brew "oclint"
brew "mint"
# brew "rustup-init"
# brew "netbirdio/tap/netbird"
# brew "openssl@1.1"
# brew "youtube-dl"
# brew "txt2tags"
# brew "pandoc"
# brew "multimarkdown"
# brew "texi2html"

cask "1password"
cask "1password-cli"
cask "buildsettingextractor"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "macfuse"
cask "stolendata-mpv"
cask "netnewswire"
cask "notion"
cask "proxyman"
cask "qbittorrent"
cask "slack"
cask "veracrypt"
cask "visual-studio-code"
cask "warp"
cask "zoom"
cask "cloudflare-warp"
cask "krisp"
cask "db-browser-for-sqlite"
cask "android-file-transfer"
cask "arc"
cask "unified-remote"
cask "firefox@nightly", args: { "require_sha": false }
cask "bluesnooze"
cask "monitorcontrol"
cask "bettertouchtool"
cask "copilot-for-xcode"
cask "multiviewer-for-f1"
cask "eqmac"
# cask "obs"
# cask "expressvpn"
# cask "nordvpn"
# cask "proxy-audio-device"
# cask "intellij-idea-ce"
# cask "docker"
# cask "postman"
# cask "xcodes"
# cask "ticktick"
# cask "vmware-fusion"
# cask "netbirdio/tap/netbird-ui"
# cask "firefox-developer-edition", args: { "require_sha": false }
# cask "obsidian"
# cask "fig"
# cask "betterdisplay"
# cask "audacity"
# cask "intellij-idea"
# cask "gpg-suite"
# cask "android-studio"
# cask "spotify"
# cask "protonvpn"
# cask "nordvpn"
# cask "pocket-casts"
# cask "gitkraken"
# cask "discord"
# cask "chatgpt", args: { "no-quarantine": true }
# cask "vlc"
# cask "raycast"
# cask "virtualbox"
# cask "telegram"
# cask "whatsapp"
# cask "macs-fan-control"
# cask "microsoft-teams"
# cask "clion"
# cask "doxygen"
# cask "discord-canary"

mas "Xcode", id: 497799835
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Amphetamine", id: 937984704
mas "Shazam", id: 897118787
mas "The Unarchiver", id: 425424353
mas "MuteKey", id: 1509590766
mas "CleanMyMac", id: 1339170533
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Word", id: 462054704
# mas "RocketSim", id: 1504940162
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Testflight", id: 899247664
# mas "Betternet", id: 1028905953
# mas "Pocket", id: 568494494
# mas "Twitter", id: 1482454543
# mas "Massenger", id: 1480068668